namespace Rasp.Api.Models.Auth
{
    // =========================================================
    // 01. REQUEST DE LOGIN
    // =========================================================
    public class LoginRequest
    {
        // =====================================================
        // 01.01 IDENTIFICAÇÃO DO USUÁRIO
        // =====================================================
        public string Login { get; set; } = string.Empty;


        // =====================================================
        // 01.02 SENHA DIGITADA
        // =====================================================
        public string Senha { get; set; } = string.Empty;
    }
}
